<?php

// 简体中文

return [
    'error'                             =>  'การผ่าตัดล้มเหลว.',
    'success'                           =>  'การผ่าตัดสำเร็จ.',
    'failed'                            =>  'ข้อผิดพลาดข้อยกเว้น.',
    'loginOk'                           =>  'เข้าสู่ระบบเรียบร้อยแล้ว.',
    'loginErr'                          =>  'ล็อกอินล้มเหลว.',
    'loginThr'                          =>  'ยกเว้นการเข้าสู่ระบบ.',
    'loginOut'                          =>  'ยกเลิกเรียบร้อยแล้ว.',
    'loginInv'                          =>  'บัญชีหมดอายุ.',
    'pmsThr'                            =>  'ยกเว้นสิทธิ์.',
    'pwdErr'                            =>  'รหัสผ่านผิดพลาด.',
    'userThr'                           =>  'ความผิดปกติของบัญชี.',
    'oauthThr'                          =>  'ข้อยกเว้น OAuth.',
    'configThr'                         =>  'ข้อมูลการตั้งค่าข้อยกเว้น.',
    'phoneThr'                          =>  'หมายเลขโทรศัพท์ผิด.',
    'userExist'                         =>  'หมายเลขโทรศัพท์ผิด.',
    'phoneExist'                        =>  'หมายเลขโทรศัพท์มือถืออยู่แล้ว.',

    // 订单状态
    'orderCancel'                                  =>   'ยกเลิกการสั่งซื้อ',
    'waitPay'                                      =>   'รอการชำระเงิน',
    'waitSend'                                     =>   'รอจัดส่ง',
    'waitRec'                                      =>   'รอรับสินค้า',
    'orderConfirm'                                 =>   'รอรับสินค้า', //ยืนยันการรับสินค้า
    'waitComment'                                  =>   'รอแสดงความคิดเห็น',
    'orderRefund'                                  =>   'การคืนเงินหลังการขาย',
    'orderReturned'                                =>   'ผลตอบแทนหลังการขาย',
    'orderRefundOver'                              =>   'หลังการขาย',
    'orderCompletion'                              =>   'เสร็จสิ้นการสั่งซื้อ',


    'waitStatus'                                   =>    'การตรวจสอบ',
    'applyStatusSuccess'                           =>    'ตรวจสอบ',
    'applyStatusCancel'                            =>    'ปฏิเสธที่จะผ่าน',
    'orderCanApplyStatus'                          =>    'ขออภัยข้อมูลที่คุณเลือกมีการตรวจสอบการสั่งซื้อ',

    'this_order_cancel'                            =>    'ฉันขอโทษแต่ออเดอร์ที่คุณเลือกถูกยกเลิก！',
    'this_order_wait_pay'                          =>    'ฉันขอโทษแต่ออเดอร์ที่คุณเลือกยังไม่ได้จ่าย！',

    'systemHandleMoney'                            =>   'การจัดการระบบ',

    // 支付类型
    'paymentWechat'                                =>   'การชำระเงินด้วยไมโครจดหมาย',
    'paymentAli'                                   =>   'จ่ายสมบัติ',
    'paymentMoney'                                 =>   'ยอดคงเหลือ',


    // สิทธิ์บางจีน
    'permission' => [
        'view'      =>  'การตรวจสอบ',
        'store'     =>  'แถมท้าย',
        'update'    =>  'ตัดต่อ',
        'destroy'   =>  'ลบทิ้ง',
        'index'     =>  'รายชื่อ',
    ],

    // อัพโหลดข้อความแสดงข้อผิดพลาด
    'upload' => [
        'fileNotFound'  =>  'ไม่พบไฟล์อัพโหลด.',
        'invalidFile'   =>  'อัพโหลดไฟล์ไม่ถูกต้อง.',
        'notAllow'      =>  'ประเภทไฟล์ไม่อนุญาตให้อัพโหลด.',
        'uploadThr'     =>  'อัพโหลดข้อยกเว้น.',
    ],

    // ข้อความที่เกี่ยวข้องsms
    'sms' => [
        'phoneError'    =>  'หมายเลขโทรศัพท์มือถือไม่ถูกต้อง.',
        'signEmpty'     =>  'ลายเซ็นไม่มี.',
        'sendErr'       =>  'ล้มเหลวในการส่งข้อความ.',
        'smsErr'        =>  'รหัสการตรวจสอบข้อผิดพลาด.',
        'smsInvalid'    =>  'รหัสการตรวจสอบความล้มเหลว.',
        'reSend'        =>  'กรุณาอย่าส่งบ่อย.',
        'phoneExists'   =>  'หมายเลขโทรศัพท์มือถืออยู่แล้ว.',
        'phoneNoExists' =>  'หมายเลขโทรศัพท์มือถือไม่มี.',
    ],

    // จ่ายpayment
    'payment' => [
        'orderErr'          =>  'ข้อผิดพลาดของข้อมูลการสั่งซื้อ.',
        'onlineRecharge'    =>  'เติมเงินออนไลน์',
        'orderPay'          =>  'การชำระเงินเพื่อการสั่งซื้อ',
        'paymentFailed'     =>  'ล้มเหลวในการเรียกเก็บเงิน.',
    ],

    // ร้านค้า
    'store' => [
        'defined'       =>  'ร้านอยู่แล้ว.',
        'notMall'       =>  'คุณไม่ได้เป็นเจ้าของร้าน.',
        'subLimit'      =>  'บัญชีย่อยไม่อนุญาตให้เปิดร้าน.',
    ],

    // 提现
    'cash' => [
        'notCheck'          =>  'กรุณากรอกข้อมูลธนาคารก่อน.',
        'moneyZero'         =>  'จำนวนเงินที่ไม่สามารถ0.',
        'moneyNotEnough'    =>  'ดุลเงินสดไม่เพียงพอ.',
    ],

    // สินค้าโภคภัณฑ์
    'goods' => [
        'checkSku'          =>  'กรุณาเลือกข้อมูลจำเพาะของผลิตภัณฑ์.',
    ],

    // การตลาด
    'discount' => [
        'over100'           =>  'ส่วนลดไม่เกิน 100.',
        'need'              =>  'จำนวนคนในกลุ่มต้องไม่น้อยกว่า 2.',
        'couponStockErr'    =>  'คูปองหมด.',
        'couponExists'      =>  'ไม่มีคูปอง.',
        'couponHas'         =>  'ได้รับคูปองแล้ว.',
    ],

    // คำสั่ง
    'order' => [
        'error'     =>  'คำสั่งที่ผิดกฎหมาย.',
        'empty'     =>  'ไม่พบคำสั่งซื้อ.',
        'handleErr' =>  'การดำเนินการสั่งซื้อล้มเหลว.',
        'stockErr'  =>  'ขาดแคลนสินค้าคงคลัง.',
        'addrErr'   =>  'ต้องระบุที่อยู่.',
        'paymentErr' =>  'วิธีการชำระเงินผิดกฎหมาย.',
        'payed'     =>  'ชำระเงินเรียบร้อยแล้วค่ะ.',
        'payErr'    =>  'การชำระเงินล้มเหลว.',
        'moneyNotEnough'    =>  'ยอดเงินไม่เพียงพอ.',
        'moneyPay'  =>  'การสร้างคำสั่งจ่ายเงินซ้ำๆ.',
        'deliveryEmpty'  =>  'ข้อมูลลอจิสติกส์ไม่สามารถเว้นว่างได้.',
        'orderSettlement'  =>  'การชำระระบบ.',
        'orderSettlementHandle'  =>  'การชำระด้วยตนเอง.',
        'goodsCommission'  =>  'ค่าคอมมิชชั่นสินค้า',
    ],
    'menu'=>[
        "work"=>"โต๊ะทำงาน",
        "goods_center"=>"ศูนย์สินค้าโภคภัณฑ์",
        "store_center"=>"ศูนย์การค้า",
        "system_center"=>"ศูนย์ระบบ",
        "user_manager"=>"การจัดการผู้ใช้",
        "role_manager"=>"การจัดการบทบาท",
        "attribute_center"=>"คุณสมบัติจำเพาะ",
        "attribute_manager"=>"การจัดการทรัพย์สิน",
        "specs_manager"=>"การจัดการข้อมูลจำเพาะ",
        "goods_manager"=>"การจัดการสินค้าโภคภัณฑ์",
        "store_config"=>"การกำหนดค่าร้านค้า",
        "store_money"=>"เงินเก็บ",
        "order_settlements"=>"คำสั่งระงับคดี",
        "cashes"=>"การถอนเงิน",
        "statistics"=>"สถิติ",
        "discount_center"=>"ศูนย์การตลาด",
        "order_center"=>"ศูนย์สั่งซื้อ",
        "order_manager"=>"การจัดการคำสั่งซื้อ",
        "refunds_order"=>"คำสั่งคืนเงิน",
        "refunds_return"=>"ส่งคืนสินค้า",
        "order_comments"=>"สั่งซื้อรีวิว",
        "distribution_manager"=>"การจัดการการจัดจำหน่าย",
        "discount_manager"=>"การจัดการคูปอง",
        "seckill_manager"=>"การจัดการเข็ม",
        "collage_manager"=>"การจัดการกลุ่ม",
        "full_manager"=>"การจัดการการลดเต็มรูปแบบ",
        "sales_analysis"=>"การวิเคราะห์การขาย",
        "freight_config"=>"การกำหนดค่าการจัดส่ง",
        "all_order"=>"ทุกออเดอร์",
        "wait_order"=>"คำสั่งที่รอดำเนินการ",
        "distributions_logs"=>"บันทึกการกระจาย",
        "coupons_manager"=>"การจัดการคูปอง",
        "coupons_logs"=>"บันทึกคูปอง",
        "dashboard"=>"แผงควบคุม",
        "chats"=>"แชทบริการลูกค้า",
    ]
];
